{
  "movies": [
    {
      "id": "1",
      "name": "Interstellar",
      "rating": 7.9,
      "overview": "This is a wider card with supporting text below as a natural lead-in to additional content",
      "imageURL": "https://image.tmdb.org/t/p/w600_and_h900_bestv2/gEU2QniE6E77NI6lCU6MxlNBvIx.jpg"
    },
    {
      "id": "2",
      "name": "Suits",
      "rating": 8.4,
      "overview": "This is a wider card with supporting text below as a natural lead-in to additional content",
      "imageURL": "https://www.themoviedb.org/t/p/w600_and_h900_bestv2/vQiryp6LioFxQThywxbC6TuoDjy.jpg"
    },
    {
      "id": "643c",
      "name": "The Dark Knight (2008)",
      "rating": "8",
      "imageURL": "https://media.themoviedb.org/t/p/w300_and_h450_bestv2/qJ2tW6WMUDux911r6m7haRef0WH.jpg",
      "overview": "Batman raises the stakes in his war on crime. With the help of Lt. Jim Gordon and District Attorney Harvey Dent, Batman sets out to dismantle the remaining criminal organizations that plague the streets. The partnership proves to be effective, but they soon find themselves prey to a reign of chaos unleashed by a rising criminal mastermind known to the terrified citizens of Gotham as the Joker."
    },
    {
      "id": "368d",
      "name": "The Lord of the Rings: The Return of the King",
      "rating": "8.9",
      "imageURL": "https://media.themoviedb.org/t/p/w300_and_h450_bestv2/rCzpDGLbOoPwLjy3OAm5NUPOTrC.jpg",
      "overview": "As armies mass for a final battle that will decide the fate of the world--and powerful, ancient forces of Light and Dark compete to determine the outcome--one member of the Fellowship of the Ring is revealed as the noble heir to the throne of the Kings of Men. Yet, the sole hope for triumph over evil lies with a brave hobbit, Frodo, who, accompanied by his loyal friend Sam and the hideous, wretched Gollum, ventures deep into the very dark heart of Mordor on his seemingly impossible quest to destroy the Ring of Power.​"
    },
    {
      "id": "42b1",
      "name": "Inception",
      "rating": "8.5",
      "imageURL": "https://media.themoviedb.org/t/p/w300_and_h450_bestv2/oYuLEt3zVCKq57qu2F8dT7NIa6f.jpg",
      "overview": "Cobb, a skilled thief who commits corporate espionage by infiltrating the subconscious of his targets is offered a chance to regain his old life as payment for a task considered to be impossible: \"inception\", the implantation of another person's idea into a target's subconscious."
    },
    {
      "id": "fb32",
      "name": "The Intouchables ",
      "rating": "7.9",
      "imageURL": "https://media.themoviedb.org/t/p/w300_and_h450_bestv2/1QU7HKgsQbGpzsJbJK4pAVQV9F5.jpg",
      "overview": "A true story of two men who should never have met – a quadriplegic aristocrat who was injured in a paragliding accident and a young man from the projects."
    },
    {
      "id": "9203",
      "name": "Gladiator",
      "rating": "7.5",
      "imageURL": "https://media.themoviedb.org/t/p/w300_and_h450_bestv2/ty8TGRuvJLPUmAR1H1nRIsgwvim.jpg",
      "overview": "In the year 180, the death of emperor Marcus Aurelius throws the Roman Empire into chaos. Maximus is one of the Roman army's most capable and trusted generals and a key advisor to the emperor. As Marcus' devious son Commodus ascends to the throne, Maximus is set to be executed. He escapes, but is captured by slave traders. Renamed Spaniard and forced to become a gladiator, Maximus must battle to the death with other men for the amusement of paying audiences."
    }
  ]
}